Revit 2026 API

# Outline Class

---

Outline is a generic object that provides a bounding box/bounding outline. It supports operations to scale and transform. It also supports intersections and contains operations.

SystemObject Autodesk.Revit.DBOutline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Outline : IDisposable
```
```vb
Public Class Outline
	Implements IDisposable
```
```cpp
public ref class Outline : IDisposable
```
```fsharp
type Outline =
    class
        interface IDisposable
    end
```

The Outline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Outline(Outline) | Constructs a new copy of the input Outline object. |
|  | Outline(XYZ, XYZ) | Constructor that uses a minimum and maximum XYZ point to initialize the outline. |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Identifies if the outline represents an empty outline. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaximumPoint | The maximum point of the bounding box. |
|  | MinimumPoint | The minimum point of the bounding box. |

|  | Name | Description |
| --- | --- | --- |
|  | AddPoint | Adds a point to the bounding box, expanding it if the point is outside the existing boundary. |
|  | Contains | Determine if this Outline contains the specified point to within a tolerance. |
|  | ContainsOtherOutline | Determine if this Outline contains another Outline to within tolerance. |
|  | Dispose | Releases all resources used by the Outline |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDiagonalLength | Get the length of outline's diagonal. If called on empty outline, 0. is returned |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Intersects | Determine if this Outline intersects the input Outline to within a specified tolerance. |
|  | IsScaleValid | Checks if given scale is valid. Should be greater than zero. |
|  | Scale | Scales the bounding box by given scale. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace